# -*- coding: utf-8 -*-
classes = {

    'ignore' : (' ','\n','\r','\t'),

    'delimiters' : ('。'),

    'stopwords' : ('#@','，','、','「','」','：','；','『','』','《','》','，','、','「','」','：','；','『','』','之','不','也','以','而','其','為','曰','者','子','有','於','十','則','無','所','故','三','二','一','是','與','夫','可','五','將','使','何','至','四','矣','自','此','太','謂','如','乃','百','皆','乎','于','在','非','六','諸','必','然','若','及','未','萬','吾','焉','我','復','千','亦','九','七','方','元','正','多','西','足','又','高','內','當','去','北','來','氏','外','同','受','反','少','常','過','后','作','因','雖','始','里','請','女','右','敢','前','易','求','說','左','起','會','定','通','對','哉','難','稱','屬','宜','聽','終','遠','盡','異','進','初','甚','本','止','興','耳','廣','益','應','還','絕','往','己','邪','固','首','由','共','徒','任','更','惠','少','文','景','武','昭','宣','元','成','哀','平','更始','光武','章','和','殤','安','順','沖','質','桓','獻','昭烈'),

   

    ### High Gods and Deities ###


    # 'high_god' : ('天','帝','上帝','后帝','天主','天地','神君','天子'),

    # 'deity' : ('仙','土','妖','姦','岳','河','神','辟','靈','風','鬼','魅','人鬼','仙人','仙者','儺神','夜叉','大神','天子','明神','神仙','神明','神祇','螭魅','鬼神'),

    # 'stoplisted_di' : ('惠帝','少帝','文帝','景帝','武帝','昭帝','宣帝','元帝','成帝','哀帝','平帝','更始帝','光武帝','章帝','和帝','殤帝','安帝','順帝','沖帝','質帝','桓帝','獻帝','昭烈帝'),

    #'stoplisted_tian' : ('天下','天子','天地'),

    # 'reduced_deity' : ('仙','妖','魅','鬼','神'),

    # 'reduced_gods' : ('天','帝'),

    # 'tianzi' : ("天子", "$"),

   

    # ### Barbarians and Chinese ###

    # 'barbarians' : ('九夷 ','夷狄','四夷','五方','夷','彝','譯','狄','北狄','象','羌','蠻','南蠻','狄鞮','西夷','西戎 ','夷','夷狄','狄','胡','戎','獦獠','九夷','虜','雜虜','白狄','僰','巴','赤狄','蜑','峒','氐','淮夷','穢','胡兒','羯','零','獠','蠻','蠻貊','蠻夷','茅戎','閩','貊','貉','羌','羌戎','犬戎','婼','戎狄','山羌','畬','四夷','侗','匈','匈奴','玁狁','霫','獯','獯鬻','薰育','猺','有緡','有戎','東夷','寄'),

    # 'chinese' : ('夏','中國','此土','漢','秦','諸夏','赤縣','大漢','東方','東土','方夏','華夏','漢地','漢土','函夏','河洛/河雒','九區','九有','九州','京夏','區夏','聖國','神縣','神州','唐','唐國','我國家','震旦','中','中邦','中華','中土','中夏','中州','州里'),

    # ### Relatives and Ancestors ###

    # 'kinship' : ('親','骨肉','親屬','父子','親戚','側室','肺腑','父兄','家人','九族','眷','眷屬','六親','戚','親眷','人人','屬','堂弟','堂兄','姻媾','種類','從妹','祖','從弟','族父母'),

    # 'ancestors' : ('祖','宗','帝','妣','考','祖師','禪祖','高祖','皇祖','母','禰','前寧人','上甲','文人','先','先臣','先帝','先人','先子','先祖','曾祖','祖妣','祖考'),

    

    # ### Parents and Grandparents ###

    # 'father' : ('父','考','翁','邪','爸','爹','寡君','公','皇','皇考','怙','君','君父','人父','王考','先君','顯考','爺','阿爺','婀爺'),

    # 'father_in_law' : ('婦翁','舅','丈人'),

    # 'parent' : ('父母','親','公姥','所生','波波摩摩','先','先人','爺孃','二親','考妣'),

    #'mother' : ('母','娘','孃','慈母','老母','母親','嬭','親母','阿母','阿孃','姐'),

    # 'mother_in_law' : ('大人','姑'),

    # 'grandfather' : ('大父','祖父'),

   

    ### Human Controls ###

    # 'human_controls' : ('堯','舜'),

    # 'evil_humans' : ('桀','紂'),



    ### Comparison Character Sets ###

    # 'punishment' : ('刑','坐','完','尸','廢','懲','拶','枷','法','治','箠','箈','耐','誅','讞','辜','阱','髡','五刑','刀杖','刑戮','刑罰','刑辟','奪爵','戮辱'),

    # 'reward' : ('償','勞','胙','賞','賜','酬','勞酒','報償','慶賞','爵賞'),

    # 'reduced_punishment' : ('刑','坐','完','尸','廢','懲','拶','枷','法','治','箠','箈','耐','誅','讞','辜','阱','髡'),

    # 'reduced_reward' : ('償','勞','胙','賞','賜','酬'),

    # 'ubc_emotion' : ('安','欲','情','乐','喜','急','忙','恐','惊','爱','怒','恶','苦','怕','欢','感','忧','萧','恨','惧','怨','患','悦','哀','虑','惜','痛','悲','怜','烦','畏','愁','慌','慕','戚','忌','困','悄','悔','嫌','羞','闷','欣','恼','厌','恤','寂','匆','恚','愧','愤','惨','惶','恋','骇','惭','恍','羡','悠','怼','惮','恳','忿','疼','闵','畅','僖','慨','妒','悼','恸','忻','栗','愕','禧','讶','兢','嫉','怅','嗔','歆','憾','懊','怡','娱','瞿','竦','厄','恺','忝','诧','逍','诟','怖','寞','怏','憎','窘','尬','恻','悯','顼','愉','怿','惕','悸','愠','觊','慑','懔','悚','惴','忏','怆','愦','缱','怔','恹'),

    # 'ubc_cognition' : ('知','意','想','思','计','志','觉','记','谋','疑','察','视','略','赏','顾','肯','选','考','算','试','决','识','晓','策','认','判','检','准','智','忘','误','祝','昏','审','惑','择','验','查','惺','悟','迷','辨','阅','痴','拟','伺','呆','搜','诘','测','谟','猜','勘','批','忆','盼','析','猷','译','铨','懂','揆','谛','揣','忖','睬','企','钝','谳'),

    # 'ubc_religion' : ('道','天','帝','命','宗','礼','法','神','圣','仪','灵','祭','寺','鬼','丧','佛','妖','祀','祥','占','魂','祠','卜','鼎','禅','祐','坛','奠','祈','菩','佑','魔','飨','卦','祷','衅','魄','俎','魅','偈','咒','祔','刹','醮','氤','傩','迦','禘','筮','瘗','瓒','魃','胙','燔','祜','谶','乩','祧','裟','牺','袈','鬯','祟','禳','俑'),

    # 'ubc_morality' : ('正','德','义','真','功','贼','信','忠','罪','善','宜','乱','孝','仁','贤','贵','恩','良','尊','崇','贞','荣','诚','假','奸','恭','惠','邪','夷','勇','凶','坏','蛮','廉','暴','恕','谦','弱','违','谨','佳','慈','豪','贪','淫','贱','慎','优','弊','杰','娇','辉','伪','睿','纯','欺','敦','粗','淳','诈','懿','矗','枉','慧','谅','骄','怠','鄙','诬','毅','哲','乖','颖','骁','咎','侠','伟','僭','孽','虐','懒','恣','俨','孜','谌','忤','婉','歹','侈','陋','谎','侃','懈','慷','愆','戾','诓','惰','悌','亵','忱','獗','婪','慝','窳','悫','谲','龌','愎'),

    # 'ubc_morality_positive' : ('德','义','忠','宜','仁','良','惠','勇','谦','谨','佳','优','敦','淳','懿','矗','毅','忱'),

    # 'ubc_morality_negative': ('罪','邪','贪','淫','欺','粗','诈','骄','怠','鄙','孽','忤','歹','侈','愆'),

   

    ### New Punishment and Reward Terms ###

    # 'super_reduced_punishment' : ('刑','廢','誅'),

    # 'super_reduced_reward' : ('償','賞','賜')
    }
