# -*- coding: utf-8 -*-
classes = {

    'ignore' : (' ','\n','\r','\t'),

    'delimiters' : ('。'),

    'no_stopwords' : (),

    'stoplist_gods' : ('惠帝','少帝','文帝','景帝','武帝','昭帝','宣帝','元帝','成帝','哀帝','平帝','更始帝','光武帝','章帝','和帝','殤帝','安帝','順帝','沖帝','質帝','桓帝','獻帝','昭烈帝','天下','天子','天地'),

    # 'stopwords' : ('之','不','也','以','而','其','為','曰','者','子','有','於','十','則','無','所','故','三','二','一','是','與','夫','可','五','將','使','何','至','四','矣','自','此','太','謂','如','乃','百','皆','乎','於','在','非','六','諸','必','然','若','及','未','萬','吾','焉','我','復','千','亦','九','七','方','元','正','多','西','足','又','高','內','當','去','北','來','氏','外','同','受','反','少','常','過','后','作','因','雖','始','裡','請','女','右','敢','前','易','求','說','左','起','會','定','通','對','哉','難','稱','屬','宜','聽','終','遠','盡','異','進','初','甚','本','止','興','耳','廣','益','應','還','絕','往','己','邪','固','首','由','共','徒','任','更'),

    # 'supernatural_stopwords' : ('之','不','也','以','而','其','為','曰','者','有','於','十','則','無','所','故','三','二','一','是','與','夫','可','五','將','使','何','至','四','矣','自','此','太','謂','如','乃','百','皆','乎','于','在','非','六','諸','必','然','若','及','未','萬','吾','焉','我','復','千','亦','九','七','方','元','多','西','足','又','高','內','當','去','北','來','氏','外','同','受','反','少','常','過','后','作','因','雖','始','里','請','右','敢','易','求','說','左','起','會','定','通','對','哉','難','稱','屬','聽','終','遠','盡','異','進','初','甚','本','止','興','耳','廣','益','應','還','絕','往','己','固','首','由','共','徒','任','更'),


    ### High Gods and Deities ###


    # 'high_god' : ('天','帝','上帝','后帝','天主','天地','神君','天子'),

    # 'deity' : ('仙','土','妖','姦','岳','河','神','辟','靈','風','鬼','魅','人鬼','仙人','仙者','儺神','夜叉','大神','天子','明神','神仙','神明','神祇','螭魅','鬼神'),

    'emperor_names' : ('惠帝','少帝','文帝','景帝','武帝','昭帝','宣帝','元帝','成帝','哀帝','平帝','更始帝','光武帝','章帝','和帝','殤帝','安帝','順帝','沖帝','質帝','桓帝','獻帝','昭烈帝'),

    'stoplisted_tian' : ('天下','天子','天地'),

    'reduced_deity' : ('仙','妖','魅','鬼','神'),

    'reduced_gods' : ('天','帝'),

    'tianzi' : ("天子", "$"),

   

    # ### Barbarians and Chinese ###

    'barbarians' : ('九夷 ','夷狄','四夷','五方','夷','彝','譯','狄','北狄','象','羌','蠻','南蠻','狄鞮','西夷','西戎 ','夷','夷狄','狄','胡','戎','獦獠','九夷','虜','雜虜','白狄','僰','巴','赤狄','蜑','峒','氐','淮夷','穢','胡兒','羯','零','獠','蠻','蠻貊','蠻夷','茅戎','閩','貊','貉','羌','羌戎','犬戎','婼','戎狄','山羌','畬','四夷','侗','匈','匈奴','玁狁','霫','獯','獯鬻','薰育','猺','有緡','有戎','東夷','寄'),

    'chinese' : ('夏','中國','此土','漢','諸夏','赤縣','大漢','方夏','華夏','漢地','漢土','函夏','河洛/河雒','九區','九有','九州','京夏','區夏','聖國','神縣','神州','震旦','中邦','中華','中土','中夏','中州','州里'),

    # ### Relatives and Ancestors ###

    'kinship' : ('親','骨肉','親屬','父子','親戚','側室','肺腑','父兄','家人','眷','眷屬','六親','戚','親眷','堂弟','堂兄','姻媾','種類','從妹','祖','從弟','族父母'),

    'ancestors' : ('祖宗','妣','祖師','禪祖','高祖','皇祖','禰','前寧人','上甲','先臣','先帝','先人','先子','先祖','曾祖','祖妣','祖考'),


    # ### Parents and Grandparents ###

    'father' : ('父','翁','邪','爸','爹','寡君','皇','皇考','怙','君父','人父','王考','先君','顯考','爺','阿爺','婀爺'),

    'father_in_law' : ('婦翁','舅','丈人'),

    'parent' : ('父母','親','公姥','所生','波波摩摩','先人','爺孃','二親','考妣'),

    'mother' : ('母','娘','孃','慈母','老母','母親','嬭','親母','阿母','阿孃','姐'),

    'mother_in_law' : ('姑'),

    'grandfather' : ('大父','祖父'),



    ### Human Controls ###

    'legendary_figures' : ('堯','舜','桀','紂'),

    'sage_kings' : ('堯','舜'),

    'famous_criminals' : ('桀','紂'),



    ### Comparison Character Sets ###

    'punishment' : ('刑','坐','完','尸','廢','懲','拶','枷','法','治','箠','箈','耐','誅','讞','辜','阱','髡','五刑','刀杖','刑戮','刑罰','刑辟','奪爵','戮辱'),

    'reward' : ('償','勞','胙','賞','賜','酬','勞酒','報償','慶賞','爵賞'),

    'reduced_punishment' : ('刑','坐','完','尸','廢','懲','拶','枷','法','治','箠','箈','耐','誅','讞','辜','阱','髡'),

    'reduced_reward' : ('償','勞','胙','賞','賜','酬'),

    'ubc_emotion' : ('安','欲','情','樂','喜','急','忙','恐','驚','愛','怒','惡','苦','怕','歡','感','憂','蕭','恨','懼','怨','患','悅','哀','慮','惜','痛','悲','憐','煩','畏','愁','慌','慕','戚','忌','困','悄','悔','嫌','羞','悶','欣','惱','厭','恤','寂','匆','恚','愧','憤','慘','惶','戀','駭','慚','恍','羨','悠','懟','憚','懇','忿','疼','閔','暢','僖','慨','妒','悼','慟','忻','栗','愕','禧','訝','兢','嫉','悵','嗔','歆','憾','懊','怡','娛','瞿','竦','厄','愷','忝','詫','逍','詬','怖','寞','怏','憎','窘','尬','惻','憫','頊','愉','懌','惕','悸','慍','覬','懾','懍','悚','惴','懺','愴','憒','繾','怔','懨'),
   
    'ubc_cognition' : ('知','意','想','思','計','志','覺','記','謀','疑','察','視','略','賞','顧','肯','選','考','算','試','決','識','曉','策','認','判','檢','准','智','忘','誤','祝','昏','審','惑','擇','驗','查','惺','悟','迷','辨','閱','痴','擬','伺','呆','搜','詰','測','謨','猜','勘','批','憶','盼','析','猷','譯','銓','懂','揆','諦','揣','忖','睬','企','鈍','讞'),

    'reduced_ubc_religion' : ('道','命','宗','禮','法','儀','靈','祭','寺','喪','佛','祀','祥','佔','魂','祠','卜','鼎','祐','壇','奠','祈','菩','佑','魔','饗','卦','禱','舋','魄','俎','偈','咒','祔','剎','醮','氤','儺','迦','禘','筮','瘞','瓚','魃','胙','燔','祜','讖','乩','祧','裟','犧','袈','鬯','祟','禳','俑'),

    # 'ubc_religion' : ('道','天','帝','命','宗','禮','法','神','聖','儀','靈','祭','寺','鬼','喪','佛','妖','祀','祥','佔','魂','祠','卜','鼎','禪','祐','壇','奠','祈','菩','佑','魔','饗','卦','禱','舋','魄','俎','魅','偈','咒','祔','剎','醮','氤','儺','迦','禘','筮','瘞','瓚','魃','胙','燔','祜','讖','乩','祧','裟','犧','袈','鬯','祟','禳','俑'),

    'ubc_morality' : ('正','德','義','真','功','賊','信','忠','罪','善','宜','亂','孝','仁','賢','貴','恩','良','尊','崇','貞','榮','誠','假','奸','恭','惠','邪','夷','勇','凶','壞','蠻','廉','暴','恕','謙','弱','違','謹','佳','慈','豪','貪','淫','賤','慎','優','弊','杰','嬌','輝','偽','睿','純','欺','敦','粗','淳','詐','懿','矗','枉','慧','諒','驕','怠','鄙','誣','毅','哲','乖','穎','驍','咎','俠','偉','僭','孽','虐','懶','恣','儼','孜','諶','忤','婉','歹','侈','陋','謊','侃','懈','慷','愆','戾','誆','惰','悌','褻','忱','獗','婪','慝','窳','愨','譎','齷','愎'),

    'ubc_morality_positive' : ('德','義','忠','宜','仁','良','惠','勇','謙','謹','佳','優','敦','淳','懿','矗','毅','忱'),

    'ubc_morality_negative': ('罪','邪','貪','淫','欺','粗','詐','驕','怠','鄙','孽','忤','歹','侈','愆'),

   

    ### New Punishment and Reward Terms ###

    'super_reduced_punishment' : ('刑','廢','誅'),

    'super_reduced_reward' : ('償','賞','賜')
}
